Tekla.Structures.ModelInternal.StringList
The StringList class defines a type safe string collection.
using Tekla.Structures.ModelInternal;
public class Example
{
public void Example1()
{
StringList stringList = new StringList();
stringList.Add("MyString");
stringList.Add("MySecondString");
}
}

Tekla.Structures.ModelInternal.StringList.Item(System.Int32)
Gets or sets the string at the specified index.
Index: The zero-based index of the element to get or set.

Tekla.Structures.ModelInternal.StringList.#ctor(System.Int32)
Creates a new string list instance with the given capacity.
Capacity: The capacity of the string list.

Tekla.Structures.ModelInternal.StringList.#ctor
Creates a new string list instance.

Tekla.Structures.ModelInternal.StringList.Add(System.String)
Adds a new string to the end of the string list.
Value: The string to be added to the list.
Returns: The index where the string was added.

Tekla.Structures.ModelInternal.StringList.Contains(System.String)
Checks if the string is in the list.
Value: The string to be checked.
Returns: True if the string is in the list, otherwise false.

Tekla.Structures.ModelInternal.StringList.IndexOf(System.String)
Gets the index of the specified string.
Value: The string to locate in the list.
Returns: The index of the string if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.StringList.IndexOf(System.String,System.Int32)
Gets the index of the specified string between the index to start
the search from and the end of the list.
Value: The string to locate in the list.
StartIndex: The index to start the search from.
Returns: The index of the string if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.StringList.IndexOf(System.String,System.Int32,System.Int32)
Gets the index of the specified string between the index to start the search from and StartIndex + Count.
Value: The string to locate in the list.
StartIndex: The index to start the search from.
Count: The number of items searched.
Returns: The index of the string if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.StringList.Insert(System.Int32,System.String)
Inserts the string to the specified index.
Index: The index where the string is inserted.
Value: The string to be inserted.

Tekla.Structures.ModelInternal.StringList.GetRange(System.Int32,System.Int32)
Gets a part of the string list.
Index: The start index of the new list.
Count: The number of items in the new list.
Returns: The new string list.

Tekla.Structures.ModelInternal.StringList.LastIndexOf(System.String)
Searches for the last occurence of the string in the list.
Value: The string to locate.
Returns: The last index of the string if found, otherwise -1.

Tekla.Structures.ModelInternal.StringList.LastIndexOf(System.String,System.Int32)
Searches for the last occurence of the string in the list.
Value: The string to locate.
StartIndex: The index to start the search from.
Returns: The last index of the string if found, otherwise -1.

Tekla.Structures.ModelInternal.StringList.LastIndexOf(System.String,System.Int32,System.Int32)
Searches for the last occurence of the string in the list.
Value: The string to locate.
StartIndex: The index to start the search from.
Count: The number of items searched.
Returns: The last index of the string if found, otherwise -1.

Tekla.Structures.ModelInternal.StringList.Remove(System.String)
Removes the first occurence of the string from the list.
Value: The string to be removed.

Tekla.Structures.ModelInternal.StringList.RemoveRange(System.Int32,System.Int32)
Removes a range of items starting from the given index.
Index: The start index.
Count: The number of items to be removed.

Tekla.Structures.ModelInternal.StringList.ToArray
Copies the strings to a string array.
Returns: The array of strings.

Tekla.Structures.ModelInternal.StringList.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.